MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F5015/mcu.h
#define _C1TX2B1_TXB2D15_POSITION                0x0000000D
#define _C1TX2B1_TXB2D15_MASK                    0x00002000
#define _C1TX2B1_TXB2D15_LENGTH                  0x00000001

#define _C1TX2B1_TXB2D16_POSITION                0x0000000E
#define _C1TX2B1_TXB2D16_MASK                    0x00004000
#define _C1TX2B1_TXB2D16_LENGTH                  0x00000001

#define _C1TX2B1_TXB2D17_POSITION                0x0000000F
#define _C1TX2B1_TXB2D17_MASK                    0x00008000
#define _C1TX2B1_TXB2D17_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D20_POSITION                0x00000000
#define _C1TX2B2_TXB2D20_MASK                    0x00000001
#define _C1TX2B2_TXB2D20_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D21_POSITION                0x00000001
#define _C1TX2B2_TXB2D21_MASK                    0x00000002
#define _C1TX2B2_TXB2D21_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D22_POSITION                0x00000002
#define _C1TX2B2_TXB2D22_MASK                    0x00000004
#define _C1TX2B2_TXB2D22_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D23_POSITION                0x00000003
#define _C1TX2B2_TXB2D23_MASK                    0x00000008
#define _C1TX2B2_TXB2D23_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D24_POSITION                0x00000004
#define _C1TX2B2_TXB2D24_MASK                    0x00000010
#define _C1TX2B2_TXB2D24_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D25_POSITION                0x00000005
#define _C1TX2B2_TXB2D25_MASK                    0x00000020
#define _C1TX2B2_TXB2D25_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D26_POSITION                0x00000006
#define _C1TX2B2_TXB2D26_MASK                    0x00000040
#define _C1TX2B2_TXB2D26_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D27_POSITION                0x00000007
#define _C1TX2B2_TXB2D27_MASK                    0x00000080
#define _C1TX2B2_TXB2D27_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D30_POSITION                0x00000008
#define _C1TX2B2_TXB2D30_MASK                    0x00000100
#define _C1TX2B2_TXB2D30_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D31_POSITION                0x00000009
#define _C1TX2B2_TXB2D31_MASK                    0x00000200
#define _C1TX2B2_TXB2D31_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D32_POSITION                0x0000000A
#define _C1TX2B2_TXB2D32_MASK                    0x00000400
#define _C1TX2B2_TXB2D32_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D33_POSITION                0x0000000B
#define _C1TX2B2_TXB2D33_MASK                    0x00000800
#define _C1TX2B2_TXB2D33_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D34_POSITION                0x0000000C
#define _C1TX2B2_TXB2D34_MASK                    0x00001000
#define _C1TX2B2_TXB2D34_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D35_POSITION                0x0000000D
#define _C1TX2B2_TXB2D35_MASK                    0x00002000
#define _C1TX2B2_TXB2D35_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D36_POSITION                0x0000000E
#define _C1TX2B2_TXB2D36_MASK                    0x00004000
#define _C1TX2B2_TXB2D36_LENGTH                  0x00000001

#define _C1TX2B2_TXB2D37_POSITION                0x0000000F
#define _C1TX2B2_TXB2D37_MASK                    0x00008000
#define _C1TX2B2_TXB2D37_LENGTH                  0x00000001

#define _C1TX2B3_TX2B2D40_POSITION               0x00000000
#define _C1TX2B3_TX2B2D40_MASK                   0x00000001
#define _C1TX2B3_TX2B2D40_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D41_POSITION               0x00000001
#define _C1TX2B3_TX2B2D41_MASK                   0x00000002
#define _C1TX2B3_TX2B2D41_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D42_POSITION               0x00000002
#define _C1TX2B3_TX2B2D42_MASK                   0x00000004
#define _C1TX2B3_TX2B2D42_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D43_POSITION               0x00000003
#define _C1TX2B3_TX2B2D43_MASK                   0x00000008
#define _C1TX2B3_TX2B2D43_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D44_POSITION               0x00000004
#define _C1TX2B3_TX2B2D44_MASK                   0x00000010
#define _C1TX2B3_TX2B2D44_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D45_POSITION               0x00000005
#define _C1TX2B3_TX2B2D45_MASK                   0x00000020
#define _C1TX2B3_TX2B2D45_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D46_POSITION               0x00000006
#define _C1TX2B3_TX2B2D46_MASK                   0x00000040
#define _C1TX2B3_TX2B2D46_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D47_POSITION               0x00000007
#define _C1TX2B3_TX2B2D47_MASK                   0x00000080
#define _C1TX2B3_TX2B2D47_LENGTH                 0x00000001

#define _C1TX2B3_TXB2D50_POSITION                0x00000008
#define _C1TX2B3_TXB2D50_MASK                    0x00000100
#define _C1TX2B3_TXB2D50_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D51_POSITION                0x00000009
#define _C1TX2B3_TXB2D51_MASK                    0x00000200
#define _C1TX2B3_TXB2D51_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D52_POSITION                0x0000000A
#define _C1TX2B3_TXB2D52_MASK                    0x00000400
#define _C1TX2B3_TXB2D52_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D53_POSITION                0x0000000B
#define _C1TX2B3_TXB2D53_MASK                    0x00000800
#define _C1TX2B3_TXB2D53_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D54_POSITION                0x0000000C
#define _C1TX2B3_TXB2D54_MASK                    0x00001000
#define _C1TX2B3_TXB2D54_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D55_POSITION                0x0000000D
#define _C1TX2B3_TXB2D55_MASK                    0x00002000
#define _C1TX2B3_TXB2D55_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D56_POSITION                0x0000000E
#define _C1TX2B3_TXB2D56_MASK                    0x00004000
#define _C1TX2B3_TXB2D56_LENGTH                  0x00000001

